{
  "planet": "Saturn",
  "symbol": "♄",
  "element": "Earth",
  "archetype": "The Divine Builder, The Wisdom of Limitation",
  "psychological_focus": "Structure needs, discipline, life lessons, responsibility, mastery, authentic authority",
  "ruling_signs": [
    "Capricorn",
    "Aquarius"
  ],
  "categories": {
    "insight": [
      "Saturn builds freedom through responsibility.",
      "Discipline protects what you value from what you want right now.",
      "Limits are the rails that let momentum become progress.",
      "Time rewards what you repeat with care.",
      "Integrity is the line between strength and force.",
      "Structure turns intention into reality.",
      "Standards you keep in private become power in public.",
      "Patience is courage stretched across time.",
      "Mastery is many small rights, not one grand gesture.",
      "Commitment is love wearing work boots.",
      "Boundaries are how respect becomes visible.",
      "Honor the constraint; invent within it.",
      "Accountability is a mirror, not a weapon.",
      "Rituals make reliability automatic.",
      "Say no so your yes can mean something.",
      "Measure what matters; ignore vanity metrics.",
      "Finish small; finish often; let finishing teach you.",
      "Rest on schedule is discipline, not indulgence.",
      "Promises kept to yourself generate confidence.",
      "Repair mistakes faster than you make excuses.",
      "Humility keeps learning open and status closed.",
      "Systems save willpower for where it truly counts.",
      "Consistency beats intensity when the calendar is long.",
      "Preparation is respect for the future.",
      "Constraints clarify design; remove one, add one rule.",
      "Authority grows from service and results.",
      "Deadlines are agreements with your future self.",
      "Craft improves under feedback, not flattery.",
      "The obstacle is part of the plan, not a detour.",
      "Pace yourself so quality can breathe.",
      "Do the boring parts beautifully.",
      "Audit your inputs; what you consume shapes what you create.",
      "Stand tall in the consequence of your choices.",
      "Honesty about capacity prevents burnout.",
      "Every habit votes for the person you are becoming.",
      "Let metrics reveal, not define, your worth.",
      "Build foundations that outlast your mood.",
      "Earned confidence is quiet and portable.",
      "Finish lines are built from start lines repeated.",
      "Leave a trail of sturdy, testable work."
    ],
    "reflection": [
      "Saturn builds freedom through responsibility. What does your body say when you read this?",
      "Discipline protects what you value from what you want right now. Which small choice could honor this today?",
      "Limits are the rails that let momentum become progress. What does your body say when you read this?",
      "Time rewards what you repeat with care. What experiment could you run this week?",
      "Integrity is the line between strength and force. What experiment could you run this week?",
      "Structure turns intention into reality. What experiment could you run this week?",
      "Standards you keep in private become power in public. What would trusting this change right now?",
      "Patience is courage stretched across time. How might you test this insight in real life?",
      "Mastery is many small rights, not one grand gesture. How might you test this insight in real life?",
      "Commitment is love wearing work boots. How would this look in your schedule?",
      "Boundaries are how respect becomes visible. What would trusting this change right now?",
      "Honor the constraint; invent within it. What experiment could you run this week?",
      "Accountability is a mirror, not a weapon. What belief must evolve for this to breathe?",
      "Rituals make reliability automatic. What does your body say when you read this?",
      "Say no so your yes can mean something. How would this look in your schedule?",
      "Measure what matters; ignore vanity metrics. Which small choice could honor this today?",
      "Finish small; finish often; let finishing teach you. How might you test this insight in real life?",
      "Rest on schedule is discipline, not indulgence. What is the kindest next step?",
      "Promises kept to yourself generate confidence. Where are you resisting this lesson?",
      "Repair mistakes faster than you make excuses. What does your body say when you read this?",
      "Humility keeps learning open and status closed. What is the kindest next step?",
      "Systems save willpower for where it truly counts. What experiment could you run this week?",
      "Consistency beats intensity when the calendar is long. Which small choice could honor this today?",
      "Preparation is respect for the future. How would this look in your schedule?",
      "Constraints clarify design; remove one, add one rule. What would trusting this change right now?",
      "Authority grows from service and results. What belief must evolve for this to breathe?",
      "Deadlines are agreements with your future self. What is the kindest next step?",
      "Craft improves under feedback, not flattery. Which small choice could honor this today?",
      "The obstacle is part of the plan, not a detour. What is the kindest next step?",
      "Pace yourself so quality can breathe. What is the kindest next step?",
      "Do the boring parts beautifully. How might you test this insight in real life?",
      "Audit your inputs; what you consume shapes what you create. What experiment could you run this week?",
      "Stand tall in the consequence of your choices. Where are you resisting this lesson?",
      "Honesty about capacity prevents burnout. Where is this already true for you?",
      "Every habit votes for the person you are becoming. Where is this already true for you?",
      "Let metrics reveal, not define, your worth. What would trusting this change right now?",
      "Build foundations that outlast your mood. What belief must evolve for this to breathe?",
      "Earned confidence is quiet and portable. Where is this already true for you?",
      "Finish lines are built from start lines repeated. What experiment could you run this week?",
      "Leave a trail of sturdy, testable work. What experiment could you run this week?"
    ],
    "contemplation": [
      "Saturn builds freedom through responsibility. Let meaning gather slowly, like stars at dusk.",
      "Discipline protects what you value from what you want right now. Notice how trust widens paths fear narrows.",
      "Limits are the rails that let momentum become progress. See joy as a form of intelligence.",
      "Time rewards what you repeat with care. Purpose tethers growth so it does not drift.",
      "Integrity is the line between strength and force. Integration makes expansion humane.",
      "Structure turns intention into reality. Notice how trust widens paths fear narrows.",
      "Standards you keep in private become power in public. Integration makes expansion humane.",
      "Patience is courage stretched across time. Purpose tethers growth so it does not drift.",
      "Mastery is many small rights, not one grand gesture. Hold the telescope and the teacup together.",
      "Commitment is love wearing work boots. Gratitude turns enough into plenty.",
      "Boundaries are how respect becomes visible. Hold the telescope and the teacup together.",
      "Honor the constraint; invent within it. Consider the rhythm of growth and digestion.",
      "Accountability is a mirror, not a weapon. Treat challenge as a lantern, not a wall.",
      "Rituals make reliability automatic. Purpose tethers growth so it does not drift.",
      "Say no so your yes can mean something. Gratitude turns enough into plenty.",
      "Measure what matters; ignore vanity metrics. Hold the telescope and the teacup together.",
      "Finish small; finish often; let finishing teach you. Hold the telescope and the teacup together.",
      "Rest on schedule is discipline, not indulgence. Consider the rhythm of growth and digestion.",
      "Promises kept to yourself generate confidence. Purpose tethers growth so it does not drift.",
      "Repair mistakes faster than you make excuses. Notice how trust widens paths fear narrows.",
      "Humility keeps learning open and status closed. Hold the telescope and the teacup together.",
      "Systems save willpower for where it truly counts. Notice how trust widens paths fear narrows.",
      "Consistency beats intensity when the calendar is long. Depth matters more than size.",
      "Preparation is respect for the future. Treat challenge as a lantern, not a wall.",
      "Constraints clarify design; remove one, add one rule. Integration makes expansion humane.",
      "Authority grows from service and results. Depth matters more than size.",
      "Deadlines are agreements with your future self. Notice how trust widens paths fear narrows.",
      "Craft improves under feedback, not flattery. Depth matters more than size.",
      "The obstacle is part of the plan, not a detour. See joy as a form of intelligence.",
      "Pace yourself so quality can breathe. Let meaning gather slowly, like stars at dusk.",
      "Do the boring parts beautifully. Hold the telescope and the teacup together.",
      "Audit your inputs; what you consume shapes what you create. Purpose tethers growth so it does not drift.",
      "Stand tall in the consequence of your choices. Depth matters more than size.",
      "Honesty about capacity prevents burnout. Gratitude turns enough into plenty.",
      "Every habit votes for the person you are becoming. Hold the telescope and the teacup together.",
      "Let metrics reveal, not define, your worth. Consider the rhythm of growth and digestion.",
      "Build foundations that outlast your mood. Integration makes expansion humane.",
      "Earned confidence is quiet and portable. Purpose tethers growth so it does not drift.",
      "Finish lines are built from start lines repeated. Depth matters more than size.",
      "Leave a trail of sturdy, testable work. Consider the rhythm of growth and digestion."
    ],
    "manifestation": [
      "Translate this into action: Laugh for three minutes; then begin.",
      "Translate this into action: Ground optimism with a plan and a promise.",
      "Translate this into action: Laugh for three minutes; then begin.",
      "Translate this into action: Give, circulate, and keep it moving.",
      "Translate this into action: Give, circulate, and keep it moving.",
      "Translate this into action: Give, circulate, and keep it moving.",
      "Translate this into action: Study something until it becomes action.",
      "Translate this into action: Replace one belief with a trusted experiment.",
      "Translate this into action: Replace one belief with a trusted experiment.",
      "Translate this into action: Reframe a challenge and extract one blessing.",
      "Translate this into action: Study something until it becomes action.",
      "Translate this into action: Give, circulate, and keep it moving.",
      "Translate this into action: Offer generosity in a concrete way.",
      "Translate this into action: Laugh for three minutes; then begin.",
      "Translate this into action: Reframe a challenge and extract one blessing.",
      "Translate this into action: Ground optimism with a plan and a promise.",
      "Translate this into action: Replace one belief with a trusted experiment.",
      "Translate this into action: Schedule quiet and let meaning find you.",
      "Translate this into action: Pause to integrate before you add more.",
      "Translate this into action: Laugh for three minutes; then begin.",
      "Translate this into action: Schedule quiet and let meaning find you.",
      "Translate this into action: Give, circulate, and keep it moving.",
      "Translate this into action: Ground optimism with a plan and a promise.",
      "Translate this into action: Reframe a challenge and extract one blessing.",
      "Translate this into action: Study something until it becomes action.",
      "Translate this into action: Offer generosity in a concrete way.",
      "Translate this into action: Schedule quiet and let meaning find you.",
      "Translate this into action: Ground optimism with a plan and a promise.",
      "Translate this into action: Schedule quiet and let meaning find you.",
      "Translate this into action: Schedule quiet and let meaning find you.",
      "Translate this into action: Replace one belief with a trusted experiment.",
      "Translate this into action: Give, circulate, and keep it moving.",
      "Translate this into action: Pause to integrate before you add more.",
      "Translate this into action: Name one opportunity and act on it.",
      "Translate this into action: Name one opportunity and act on it.",
      "Translate this into action: Study something until it becomes action.",
      "Translate this into action: Offer generosity in a concrete way.",
      "Translate this into action: Name one opportunity and act on it.",
      "Translate this into action: Give, circulate, and keep it moving.",
      "Translate this into action: Give, circulate, and keep it moving."
    ],
    "challenge": [
      "Edge of growth: Test optimism against reality, not fantasy.",
      "Edge of growth: Distinguish faith from wishful thinking.",
      "Edge of growth: Do not mistake quantity for wisdom.",
      "Edge of growth: Pause excess; integrate experience.",
      "Edge of growth: Anchor vision in responsibility.",
      "Edge of growth: Distinguish faith from wishful thinking.",
      "Edge of growth: Anchor vision in responsibility.",
      "Edge of growth: Pause excess; integrate experience.",
      "Edge of growth: Notice where generosity masks approval-seeking.",
      "Edge of growth: Avoid using joy as avoidance.",
      "Edge of growth: Notice where generosity masks approval-seeking.",
      "Edge of growth: Beware expansion for display—seek depth.",
      "Edge of growth: Question the cage of a favorite belief.",
      "Edge of growth: Pause excess; integrate experience.",
      "Edge of growth: Avoid using joy as avoidance.",
      "Edge of growth: Notice where generosity masks approval-seeking.",
      "Edge of growth: Notice where generosity masks approval-seeking.",
      "Edge of growth: Beware expansion for display—seek depth.",
      "Edge of growth: Pause excess; integrate experience.",
      "Edge of growth: Distinguish faith from wishful thinking.",
      "Edge of growth: Notice where generosity masks approval-seeking.",
      "Edge of growth: Distinguish faith from wishful thinking.",
      "Edge of growth: Let timing humble urgency.",
      "Edge of growth: Question the cage of a favorite belief.",
      "Edge of growth: Anchor vision in responsibility.",
      "Edge of growth: Let timing humble urgency.",
      "Edge of growth: Distinguish faith from wishful thinking.",
      "Edge of growth: Let timing humble urgency.",
      "Edge of growth: Do not mistake quantity for wisdom.",
      "Edge of growth: Test optimism against reality, not fantasy.",
      "Edge of growth: Notice where generosity masks approval-seeking.",
      "Edge of growth: Pause excess; integrate experience.",
      "Edge of growth: Let timing humble urgency.",
      "Edge of growth: Avoid using joy as avoidance.",
      "Edge of growth: Notice where generosity masks approval-seeking.",
      "Edge of growth: Beware expansion for display—seek depth.",
      "Edge of growth: Anchor vision in responsibility.",
      "Edge of growth: Pause excess; integrate experience.",
      "Edge of growth: Let timing humble urgency.",
      "Edge of growth: Beware expansion for display—seek depth."
    ],
    "physical_practice": [
      "Do a 2‑minute smile-breath laughter set.",
      "Make a two-column bridge: optimism ↔ plan.",
      "Do a 2‑minute smile-breath laughter set.",
      "Give time, attention, or resources today.",
      "Give time, attention, or resources today.",
      "Give time, attention, or resources today.",
      "Study 20 minutes; teach one insight aloud.",
      "Journal one belief you will test today.",
      "Journal one belief you will test today.",
      "List three blessings hidden in a challenge.",
      "Study 20 minutes; teach one insight aloud.",
      "Give time, attention, or resources today.",
      "Walk 12 minutes naming possibilities.",
      "Do a 2‑minute smile-breath laughter set.",
      "List three blessings hidden in a challenge.",
      "Make a two-column bridge: optimism ↔ plan.",
      "Journal one belief you will test today.",
      "Sit 7 minutes and let meaning arise.",
      "Set a 'digest' pause after big tasks.",
      "Do a 2‑minute smile-breath laughter set.",
      "Sit 7 minutes and let meaning arise.",
      "Give time, attention, or resources today.",
      "Make a two-column bridge: optimism ↔ plan.",
      "List three blessings hidden in a challenge.",
      "Study 20 minutes; teach one insight aloud.",
      "Walk 12 minutes naming possibilities.",
      "Sit 7 minutes and let meaning arise.",
      "Make a two-column bridge: optimism ↔ plan.",
      "Sit 7 minutes and let meaning arise.",
      "Sit 7 minutes and let meaning arise.",
      "Journal one belief you will test today.",
      "Give time, attention, or resources today.",
      "Set a 'digest' pause after big tasks.",
      "Write a gratitude ladder of 10 rungs.",
      "Write a gratitude ladder of 10 rungs.",
      "Study 20 minutes; teach one insight aloud.",
      "Walk 12 minutes naming possibilities.",
      "Write a gratitude ladder of 10 rungs.",
      "Give time, attention, or resources today.",
      "Give time, attention, or resources today."
    ],
    "shadow": [
      "Shadow signal: Arrogance hides inside unexamined certainty.",
      "Shadow signal: Excess generosity can control in disguise.",
      "Shadow signal: Escapist optimism dulls discernment.",
      "Shadow signal: Collecting knowledge without practice inflates ego.",
      "Shadow signal: Hoarded abundance grows stagnant.",
      "Shadow signal: Excess generosity can control in disguise.",
      "Shadow signal: Hoarded abundance grows stagnant.",
      "Shadow signal: Collecting knowledge without practice inflates ego.",
      "Shadow signal: Grand plans without humility collapse.",
      "Shadow signal: Joy as avoidance becomes a mask.",
      "Shadow signal: Grand plans without humility collapse.",
      "Shadow signal: Overreach without integration scatters power.",
      "Shadow signal: Dogma is belief that stopped growing.",
      "Shadow signal: Collecting knowledge without practice inflates ego.",
      "Shadow signal: Joy as avoidance becomes a mask.",
      "Shadow signal: Grand plans without humility collapse.",
      "Shadow signal: Grand plans without humility collapse.",
      "Shadow signal: Overreach without integration scatters power.",
      "Shadow signal: Collecting knowledge without practice inflates ego.",
      "Shadow signal: Excess generosity can control in disguise.",
      "Shadow signal: Grand plans without humility collapse.",
      "Shadow signal: Excess generosity can control in disguise.",
      "Shadow signal: Confusing luck with grace erodes gratitude.",
      "Shadow signal: Dogma is belief that stopped growing.",
      "Shadow signal: Hoarded abundance grows stagnant.",
      "Shadow signal: Confusing luck with grace erodes gratitude.",
      "Shadow signal: Excess generosity can control in disguise.",
      "Shadow signal: Confusing luck with grace erodes gratitude.",
      "Shadow signal: Escapist optimism dulls discernment.",
      "Shadow signal: Arrogance hides inside unexamined certainty.",
      "Shadow signal: Grand plans without humility collapse.",
      "Shadow signal: Collecting knowledge without practice inflates ego.",
      "Shadow signal: Confusing luck with grace erodes gratitude.",
      "Shadow signal: Joy as avoidance becomes a mask.",
      "Shadow signal: Grand plans without humility collapse.",
      "Shadow signal: Overreach without integration scatters power.",
      "Shadow signal: Hoarded abundance grows stagnant.",
      "Shadow signal: Collecting knowledge without practice inflates ego.",
      "Shadow signal: Confusing luck with grace erodes gratitude.",
      "Shadow signal: Overreach without integration scatters power."
    ],
    "archetype": [
      "As archetype: The Integrator turns expansion into embodiment.",
      "As archetype: The Cheerful Healer mends with honest optimism.",
      "As archetype: The Integrator turns expansion into embodiment.",
      "As archetype: The Bridge‑Builder joins vision to responsibility.",
      "As archetype: The Bridge‑Builder joins vision to responsibility.",
      "As archetype: The Bridge‑Builder joins vision to responsibility.",
      "As archetype: The Philosopher turns experience into lamp light.",
      "As archetype: The Pilgrim learns by walking.",
      "As archetype: The Pilgrim learns by walking.",
      "As archetype: The Explorer trusts maps drawn by practice.",
      "As archetype: The Philosopher turns experience into lamp light.",
      "As archetype: The Bridge‑Builder joins vision to responsibility.",
      "As archetype: The Benefactor multiplies blessings by circulation.",
      "As archetype: The Integrator turns expansion into embodiment.",
      "As archetype: The Explorer trusts maps drawn by practice.",
      "As archetype: The Cheerful Healer mends with honest optimism.",
      "As archetype: The Pilgrim learns by walking.",
      "As archetype: The Mentor frames setbacks as syllables of wisdom.",
      "As archetype: The Storyteller threads meaning through memory.",
      "As archetype: The Integrator turns expansion into embodiment.",
      "As archetype: The Mentor frames setbacks as syllables of wisdom.",
      "As archetype: The Bridge‑Builder joins vision to responsibility.",
      "As archetype: The Cheerful Healer mends with honest optimism.",
      "As archetype: The Explorer trusts maps drawn by practice.",
      "As archetype: The Philosopher turns experience into lamp light.",
      "As archetype: The Benefactor multiplies blessings by circulation.",
      "As archetype: The Mentor frames setbacks as syllables of wisdom.",
      "As archetype: The Cheerful Healer mends with honest optimism.",
      "As archetype: The Mentor frames setbacks as syllables of wisdom.",
      "As archetype: The Mentor frames setbacks as syllables of wisdom.",
      "As archetype: The Pilgrim learns by walking.",
      "As archetype: The Bridge‑Builder joins vision to responsibility.",
      "As archetype: The Storyteller threads meaning through memory.",
      "As archetype: The Sage widens horizons through lived questions.",
      "As archetype: The Sage widens horizons through lived questions.",
      "As archetype: The Philosopher turns experience into lamp light.",
      "As archetype: The Benefactor multiplies blessings by circulation.",
      "As archetype: The Sage widens horizons through lived questions.",
      "As archetype: The Bridge‑Builder joins vision to responsibility.",
      "As archetype: The Bridge‑Builder joins vision to responsibility."
    ],
    "energy_check": [
      "Vibe: grounded optimism with clear edges.",
      "Vibe: philosophical, curious, meaning‑rich.",
      "Vibe: joyful gravitas—light with roots.",
      "Vibe: blessing‑aware—teachers everywhere.",
      "Vibe: wise laughter—serious about joy.",
      "Vibe: philosophical, curious, meaning‑rich.",
      "Vibe: wise laughter—serious about joy.",
      "Vibe: blessing‑aware—teachers everywhere.",
      "Vibe: trust‑forward—timing over urgency.",
      "Vibe: integrative expansion—grow, then digest.",
      "Vibe: trust‑forward—timing over urgency.",
      "Vibe: spacious, generous, horizon‑seeking.",
      "Vibe: flowing abundance—give and circulate.",
      "Vibe: blessing‑aware—teachers everywhere.",
      "Vibe: integrative expansion—grow, then digest.",
      "Vibe: trust‑forward—timing over urgency.",
      "Vibe: trust‑forward—timing over urgency.",
      "Vibe: spacious, generous, horizon‑seeking.",
      "Vibe: blessing‑aware—teachers everywhere.",
      "Vibe: philosophical, curious, meaning‑rich.",
      "Vibe: trust‑forward—timing over urgency.",
      "Vibe: philosophical, curious, meaning‑rich.",
      "Vibe: disciplined freedom—wide yet held.",
      "Vibe: flowing abundance—give and circulate.",
      "Vibe: wise laughter—serious about joy.",
      "Vibe: disciplined freedom—wide yet held.",
      "Vibe: philosophical, curious, meaning‑rich.",
      "Vibe: disciplined freedom—wide yet held.",
      "Vibe: joyful gravitas—light with roots.",
      "Vibe: grounded optimism with clear edges.",
      "Vibe: trust‑forward—timing over urgency.",
      "Vibe: blessing‑aware—teachers everywhere.",
      "Vibe: disciplined freedom—wide yet held.",
      "Vibe: integrative expansion—grow, then digest.",
      "Vibe: trust‑forward—timing over urgency.",
      "Vibe: spacious, generous, horizon‑seeking.",
      "Vibe: wise laughter—serious about joy.",
      "Vibe: blessing‑aware—teachers everywhere.",
      "Vibe: disciplined freedom—wide yet held.",
      "Vibe: spacious, generous, horizon‑seeking."
    ],
    "astrological": [
      "During favorable periods, widen learning and travel curiosity.",
      "When supportive aspects arise, mentor or be mentored.",
      "Under growth transits, align generosity with discernment.",
      "In expansion seasons, study frameworks of meaning.",
      "When your chart ruler is touched, say yes to responsible growth.",
      "Through fire cycles, act boldly—then integrate.",
      "Through earth cycles, systematize growth.",
      "Through air cycles, share ideas widely.",
      "Through water cycles, cultivate compassionate trust.",
      "At personal returns, refresh your horizon.",
      "During favorable periods, widen learning and travel curiosity.",
      "When supportive aspects arise, mentor or be mentored.",
      "Under growth transits, align generosity with discernment.",
      "In expansion seasons, study frameworks of meaning.",
      "When your chart ruler is touched, say yes to responsible growth.",
      "Through fire cycles, act boldly—then integrate.",
      "Through earth cycles, systematize growth.",
      "Through air cycles, share ideas widely.",
      "Through water cycles, cultivate compassionate trust.",
      "At personal returns, refresh your horizon.",
      "During favorable periods, widen learning and travel curiosity.",
      "When supportive aspects arise, mentor or be mentored.",
      "Under growth transits, align generosity with discernment.",
      "In expansion seasons, study frameworks of meaning.",
      "When your chart ruler is touched, say yes to responsible growth.",
      "Through fire cycles, act boldly—then integrate.",
      "Through earth cycles, systematize growth.",
      "Through air cycles, share ideas widely.",
      "Through water cycles, cultivate compassionate trust.",
      "At personal returns, refresh your horizon.",
      "During favorable periods, widen learning and travel curiosity.",
      "When supportive aspects arise, mentor or be mentored.",
      "Under growth transits, align generosity with discernment.",
      "In expansion seasons, study frameworks of meaning.",
      "When your chart ruler is touched, say yes to responsible growth.",
      "Through fire cycles, act boldly—then integrate.",
      "Through earth cycles, systematize growth.",
      "Through air cycles, share ideas widely.",
      "Through water cycles, cultivate compassionate trust.",
      "At personal returns, refresh your horizon."
    ]
  },
  "meta": {
    "version": "2.0",
    "stage": "expanded_400",
    "generated_at": "2025-08-20T19:47:25",
    "counts": {
      "insight": 40,
      "reflection": 40,
      "contemplation": 40,
      "manifestation": 40,
      "challenge": 40,
      "physical_practice": 40,
      "shadow": 40,
      "archetype": 40,
      "energy_check": 40,
      "astrological": 40
    },
    "note": "Gold-standard build: 10 categories × 40 insights (generic, duplicate-free)."
  },
  "primary_persona": "NumerologyScholar"
}
