{
  "planet": "Sun",
  "symbol": "☉",
  "element": "Fire",
  "archetype": "The Sovereign Self, Vital Creative Core",
  "psychological_focus": "Identity, vitality, purpose, authenticity, leadership, creativity, self‑respect",
  "ruling_signs": [
    "Leo"
  ],
  "categories": {
    "insight": [
      "Sun energy invites radical authenticity that warms rather than burns.",
      "Vitality grows where your actions match your values.",
      "Self‑respect is a renewable fuel when you honor your word.",
      "Purpose clarifies when you choose service over spotlight.",
      "Confidence is quiet when rooted in competence.",
      "Creativity is sunlight for the soul—make something daily.",
      "Leadership begins with self‑leadership under pressure.",
      "Your presence is power; arrive as who you are.",
      "Integrity makes charisma trustworthy.",
      "Attention is the climate your character grows in—set it to clear.",
      "Say yes to what lights you; say no to what dims you.",
      "Identity matures when you outgrow costumes that once protected you.",
      "Warmth is a resource—radiate without depletion.",
      "Courage is revealing your true face, not a perfect mask.",
      "Generosity of spirit is the Sun's native language.",
      "Let your standards be a sunrise, predictable and steady.",
      "Shine where you are needed, not merely where you are seen.",
      "Sovereignty is the art of owning your choices.",
      "Celebrate progress as fuel for the next mile.",
      "Discipline keeps the light steady when moods flicker.",
      "Be the person your promises imagine.",
      "Give credit like sunlight—freely and often.",
      "Reputation is shadow; character is the source.",
      "Clarity is kind; say the true thing simply.",
      "Your best influence is example, not performance.",
      "Nobility is ordinary goodness done consistently.",
      "Let feedback polish rather than puncture your core.",
      "Wholeness arrives when you stop outsourcing your worth.",
      "Rest protects radiance; schedule it.",
      "Humility keeps the Sun from scorching.",
      "Choose targets worthy of your light.",
      "Boundaries keep your warmth from being siphoned.",
      "Name your values; design your day around them.",
      "Let courage and kindness travel together.",
      "Become someone your future self can thank.",
      "Align your calendar with your character.",
      "Refuse to dim to fit; adjust context instead.",
      "Center joy in your work; it scales stamina.",
      "Be light others can navigate by when storms roll in.",
      "Live so your eulogy writes itself in verbs."
    ],
    "reflection": [
      "Sun energy invites radical authenticity that warms rather than burns. What experiment could you run this week?",
      "Vitality grows where your actions match your values. How might you test this insight in real life?",
      "Self‑respect is a renewable fuel when you honor your word. How would this look in your schedule?",
      "Purpose clarifies when you choose service over spotlight. What is the kindest next step?",
      "Confidence is quiet when rooted in competence. Where are you resisting this lesson?",
      "Creativity is sunlight for the soul—make something daily. What is the kindest next step?",
      "Leadership begins with self‑leadership under pressure. Which small choice could honor this today?",
      "Your presence is power; arrive as who you are. Where are you resisting this lesson?",
      "Integrity makes charisma trustworthy. What is the kindest next step?",
      "Attention is the climate your character grows in—set it to clear. What does your body say when you read this?",
      "Say yes to what lights you; say no to what dims you. How might you test this insight in real life?",
      "Identity matures when you outgrow costumes that once protected you. What is the kindest next step?",
      "Warmth is a resource—radiate without depletion. What is the kindest next step?",
      "Courage is revealing your true face, not a perfect mask. Where are you resisting this lesson?",
      "Generosity of spirit is the Sun's native language. Where is this already true for you?",
      "Let your standards be a sunrise, predictable and steady. Where are you resisting this lesson?",
      "Shine where you are needed, not merely where you are seen. How would this look in your schedule?",
      "Sovereignty is the art of owning your choices. Where are you resisting this lesson?",
      "Celebrate progress as fuel for the next mile. What does your body say when you read this?",
      "Discipline keeps the light steady when moods flicker. What would trusting this change right now?",
      "Be the person your promises imagine. Where are you resisting this lesson?",
      "Give credit like sunlight—freely and often. What would trusting this change right now?",
      "Reputation is shadow; character is the source. Where are you resisting this lesson?",
      "Clarity is kind; say the true thing simply. What would trusting this change right now?",
      "Your best influence is example, not performance. How would this look in your schedule?",
      "Nobility is ordinary goodness done consistently. How would this look in your schedule?",
      "Let feedback polish rather than puncture your core. What belief must evolve for this to breathe?",
      "Wholeness arrives when you stop outsourcing your worth. What does your body say when you read this?",
      "Rest protects radiance; schedule it. Where are you resisting this lesson?",
      "Humility keeps the Sun from scorching. How would this look in your schedule?",
      "Choose targets worthy of your light. Where are you resisting this lesson?",
      "Boundaries keep your warmth from being siphoned. How would this look in your schedule?",
      "Name your values; design your day around them. Where are you resisting this lesson?",
      "Let courage and kindness travel together. What belief must evolve for this to breathe?",
      "Become someone your future self can thank. How might you test this insight in real life?",
      "Align your calendar with your character. Where is this already true for you?",
      "Refuse to dim to fit; adjust context instead. What does your body say when you read this?",
      "Center joy in your work; it scales stamina. What would trusting this change right now?",
      "Be light others can navigate by when storms roll in. How might you test this insight in real life?",
      "Live so your eulogy writes itself in verbs. What would trusting this change right now?"
    ],
    "contemplation": [
      "Sun energy invites radical authenticity that warms rather than burns. Hold the telescope and the teacup together.",
      "Vitality grows where your actions match your values. Gratitude turns enough into plenty.",
      "Self‑respect is a renewable fuel when you honor your word. Hold the telescope and the teacup together.",
      "Purpose clarifies when you choose service over spotlight. Hold the telescope and the teacup together.",
      "Confidence is quiet when rooted in competence. Gratitude turns enough into plenty.",
      "Creativity is sunlight for the soul—make something daily. See joy as a form of intelligence.",
      "Leadership begins with self‑leadership under pressure. Depth matters more than size.",
      "Your presence is power; arrive as who you are. Gratitude turns enough into plenty.",
      "Integrity makes charisma trustworthy. Integration makes expansion humane.",
      "Attention is the climate your character grows in—set it to clear. Gratitude turns enough into plenty.",
      "Say yes to what lights you; say no to what dims you. See joy as a form of intelligence.",
      "Identity matures when you outgrow costumes that once protected you. Depth matters more than size.",
      "Warmth is a resource—radiate without depletion. See joy as a form of intelligence.",
      "Courage is revealing your true face, not a perfect mask. Gratitude turns enough into plenty.",
      "Generosity of spirit is the Sun's native language. See joy as a form of intelligence.",
      "Let your standards be a sunrise, predictable and steady. See joy as a form of intelligence.",
      "Shine where you are needed, not merely where you are seen. Consider the rhythm of growth and digestion.",
      "Sovereignty is the art of owning your choices. Consider the rhythm of growth and digestion.",
      "Celebrate progress as fuel for the next mile. Let meaning gather slowly, like stars at dusk.",
      "Discipline keeps the light steady when moods flicker. Purpose tethers growth so it does not drift.",
      "Be the person your promises imagine. Depth matters more than size.",
      "Give credit like sunlight—freely and often. Integration makes expansion humane.",
      "Reputation is shadow; character is the source. Integration makes expansion humane.",
      "Clarity is kind; say the true thing simply. Depth matters more than size.",
      "Your best influence is example, not performance. Integration makes expansion humane.",
      "Nobility is ordinary goodness done consistently. See joy as a form of intelligence.",
      "Let feedback polish rather than puncture your core. Purpose tethers growth so it does not drift.",
      "Wholeness arrives when you stop outsourcing your worth. Purpose tethers growth so it does not drift.",
      "Rest protects radiance; schedule it. Consider the rhythm of growth and digestion.",
      "Humility keeps the Sun from scorching. See joy as a form of intelligence.",
      "Choose targets worthy of your light. Consider the rhythm of growth and digestion.",
      "Boundaries keep your warmth from being siphoned. Notice how trust widens paths fear narrows.",
      "Name your values; design your day around them. Gratitude turns enough into plenty.",
      "Let courage and kindness travel together. See joy as a form of intelligence.",
      "Become someone your future self can thank. Consider the rhythm of growth and digestion.",
      "Align your calendar with your character. Integration makes expansion humane.",
      "Refuse to dim to fit; adjust context instead. Hold the telescope and the teacup together.",
      "Center joy in your work; it scales stamina. Let meaning gather slowly, like stars at dusk.",
      "Be light others can navigate by when storms roll in. Integration makes expansion humane.",
      "Live so your eulogy writes itself in verbs. Gratitude turns enough into plenty."
    ],
    "manifestation": [
      "Translate this into action: Give, circulate, and keep it moving.",
      "Translate this into action: Replace one belief with a trusted experiment.",
      "Translate this into action: Reframe a challenge and extract one blessing.",
      "Translate this into action: Schedule quiet and let meaning find you.",
      "Translate this into action: Pause to integrate before you add more.",
      "Translate this into action: Schedule quiet and let meaning find you.",
      "Translate this into action: Ground optimism with a plan and a promise.",
      "Translate this into action: Pause to integrate before you add more.",
      "Translate this into action: Schedule quiet and let meaning find you.",
      "Translate this into action: Laugh for three minutes; then begin.",
      "Translate this into action: Replace one belief with a trusted experiment.",
      "Translate this into action: Schedule quiet and let meaning find you.",
      "Translate this into action: Schedule quiet and let meaning find you.",
      "Translate this into action: Pause to integrate before you add more.",
      "Translate this into action: Name one opportunity and act on it.",
      "Translate this into action: Pause to integrate before you add more.",
      "Translate this into action: Reframe a challenge and extract one blessing.",
      "Translate this into action: Pause to integrate before you add more.",
      "Translate this into action: Laugh for three minutes; then begin.",
      "Translate this into action: Study something until it becomes action.",
      "Translate this into action: Pause to integrate before you add more.",
      "Translate this into action: Study something until it becomes action.",
      "Translate this into action: Pause to integrate before you add more.",
      "Translate this into action: Study something until it becomes action.",
      "Translate this into action: Reframe a challenge and extract one blessing.",
      "Translate this into action: Reframe a challenge and extract one blessing.",
      "Translate this into action: Offer generosity in a concrete way.",
      "Translate this into action: Laugh for three minutes; then begin.",
      "Translate this into action: Pause to integrate before you add more.",
      "Translate this into action: Reframe a challenge and extract one blessing.",
      "Translate this into action: Pause to integrate before you add more.",
      "Translate this into action: Reframe a challenge and extract one blessing.",
      "Translate this into action: Pause to integrate before you add more.",
      "Translate this into action: Offer generosity in a concrete way.",
      "Translate this into action: Replace one belief with a trusted experiment.",
      "Translate this into action: Name one opportunity and act on it.",
      "Translate this into action: Laugh for three minutes; then begin.",
      "Translate this into action: Study something until it becomes action.",
      "Translate this into action: Replace one belief with a trusted experiment.",
      "Translate this into action: Study something until it becomes action."
    ],
    "challenge": [
      "Edge of growth: Notice where generosity masks approval-seeking.",
      "Edge of growth: Avoid using joy as avoidance.",
      "Edge of growth: Notice where generosity masks approval-seeking.",
      "Edge of growth: Notice where generosity masks approval-seeking.",
      "Edge of growth: Avoid using joy as avoidance.",
      "Edge of growth: Do not mistake quantity for wisdom.",
      "Edge of growth: Let timing humble urgency.",
      "Edge of growth: Avoid using joy as avoidance.",
      "Edge of growth: Anchor vision in responsibility.",
      "Edge of growth: Avoid using joy as avoidance.",
      "Edge of growth: Do not mistake quantity for wisdom.",
      "Edge of growth: Let timing humble urgency.",
      "Edge of growth: Do not mistake quantity for wisdom.",
      "Edge of growth: Avoid using joy as avoidance.",
      "Edge of growth: Do not mistake quantity for wisdom.",
      "Edge of growth: Do not mistake quantity for wisdom.",
      "Edge of growth: Beware expansion for display—seek depth.",
      "Edge of growth: Beware expansion for display—seek depth.",
      "Edge of growth: Test optimism against reality, not fantasy.",
      "Edge of growth: Pause excess; integrate experience.",
      "Edge of growth: Let timing humble urgency.",
      "Edge of growth: Anchor vision in responsibility.",
      "Edge of growth: Anchor vision in responsibility.",
      "Edge of growth: Let timing humble urgency.",
      "Edge of growth: Anchor vision in responsibility.",
      "Edge of growth: Do not mistake quantity for wisdom.",
      "Edge of growth: Pause excess; integrate experience.",
      "Edge of growth: Pause excess; integrate experience.",
      "Edge of growth: Beware expansion for display—seek depth.",
      "Edge of growth: Do not mistake quantity for wisdom.",
      "Edge of growth: Beware expansion for display—seek depth.",
      "Edge of growth: Distinguish faith from wishful thinking.",
      "Edge of growth: Avoid using joy as avoidance.",
      "Edge of growth: Do not mistake quantity for wisdom.",
      "Edge of growth: Beware expansion for display—seek depth.",
      "Edge of growth: Anchor vision in responsibility.",
      "Edge of growth: Notice where generosity masks approval-seeking.",
      "Edge of growth: Test optimism against reality, not fantasy.",
      "Edge of growth: Anchor vision in responsibility.",
      "Edge of growth: Avoid using joy as avoidance."
    ],
    "physical_practice": [
      "Give time, attention, or resources today.",
      "Journal one belief you will test today.",
      "List three blessings hidden in a challenge.",
      "Sit 7 minutes and let meaning arise.",
      "Set a 'digest' pause after big tasks.",
      "Sit 7 minutes and let meaning arise.",
      "Make a two-column bridge: optimism ↔ plan.",
      "Set a 'digest' pause after big tasks.",
      "Sit 7 minutes and let meaning arise.",
      "Do a 2‑minute smile-breath laughter set.",
      "Journal one belief you will test today.",
      "Sit 7 minutes and let meaning arise.",
      "Sit 7 minutes and let meaning arise.",
      "Set a 'digest' pause after big tasks.",
      "Write a gratitude ladder of 10 rungs.",
      "Set a 'digest' pause after big tasks.",
      "List three blessings hidden in a challenge.",
      "Set a 'digest' pause after big tasks.",
      "Do a 2‑minute smile-breath laughter set.",
      "Study 20 minutes; teach one insight aloud.",
      "Set a 'digest' pause after big tasks.",
      "Study 20 minutes; teach one insight aloud.",
      "Set a 'digest' pause after big tasks.",
      "Study 20 minutes; teach one insight aloud.",
      "List three blessings hidden in a challenge.",
      "List three blessings hidden in a challenge.",
      "Walk 12 minutes naming possibilities.",
      "Do a 2‑minute smile-breath laughter set.",
      "Set a 'digest' pause after big tasks.",
      "List three blessings hidden in a challenge.",
      "Set a 'digest' pause after big tasks.",
      "List three blessings hidden in a challenge.",
      "Set a 'digest' pause after big tasks.",
      "Walk 12 minutes naming possibilities.",
      "Journal one belief you will test today.",
      "Write a gratitude ladder of 10 rungs.",
      "Do a 2‑minute smile-breath laughter set.",
      "Study 20 minutes; teach one insight aloud.",
      "Journal one belief you will test today.",
      "Study 20 minutes; teach one insight aloud."
    ],
    "shadow": [
      "Shadow signal: Grand plans without humility collapse.",
      "Shadow signal: Joy as avoidance becomes a mask.",
      "Shadow signal: Grand plans without humility collapse.",
      "Shadow signal: Grand plans without humility collapse.",
      "Shadow signal: Joy as avoidance becomes a mask.",
      "Shadow signal: Escapist optimism dulls discernment.",
      "Shadow signal: Confusing luck with grace erodes gratitude.",
      "Shadow signal: Joy as avoidance becomes a mask.",
      "Shadow signal: Hoarded abundance grows stagnant.",
      "Shadow signal: Joy as avoidance becomes a mask.",
      "Shadow signal: Escapist optimism dulls discernment.",
      "Shadow signal: Confusing luck with grace erodes gratitude.",
      "Shadow signal: Escapist optimism dulls discernment.",
      "Shadow signal: Joy as avoidance becomes a mask.",
      "Shadow signal: Escapist optimism dulls discernment.",
      "Shadow signal: Escapist optimism dulls discernment.",
      "Shadow signal: Overreach without integration scatters power.",
      "Shadow signal: Overreach without integration scatters power.",
      "Shadow signal: Arrogance hides inside unexamined certainty.",
      "Shadow signal: Collecting knowledge without practice inflates ego.",
      "Shadow signal: Confusing luck with grace erodes gratitude.",
      "Shadow signal: Hoarded abundance grows stagnant.",
      "Shadow signal: Hoarded abundance grows stagnant.",
      "Shadow signal: Confusing luck with grace erodes gratitude.",
      "Shadow signal: Hoarded abundance grows stagnant.",
      "Shadow signal: Escapist optimism dulls discernment.",
      "Shadow signal: Collecting knowledge without practice inflates ego.",
      "Shadow signal: Collecting knowledge without practice inflates ego.",
      "Shadow signal: Overreach without integration scatters power.",
      "Shadow signal: Escapist optimism dulls discernment.",
      "Shadow signal: Overreach without integration scatters power.",
      "Shadow signal: Excess generosity can control in disguise.",
      "Shadow signal: Joy as avoidance becomes a mask.",
      "Shadow signal: Escapist optimism dulls discernment.",
      "Shadow signal: Overreach without integration scatters power.",
      "Shadow signal: Hoarded abundance grows stagnant.",
      "Shadow signal: Grand plans without humility collapse.",
      "Shadow signal: Arrogance hides inside unexamined certainty.",
      "Shadow signal: Hoarded abundance grows stagnant.",
      "Shadow signal: Joy as avoidance becomes a mask."
    ],
    "archetype": [
      "As archetype: The Bridge‑Builder joins vision to responsibility.",
      "As archetype: The Pilgrim learns by walking.",
      "As archetype: The Explorer trusts maps drawn by practice.",
      "As archetype: The Mentor frames setbacks as syllables of wisdom.",
      "As archetype: The Storyteller threads meaning through memory.",
      "As archetype: The Mentor frames setbacks as syllables of wisdom.",
      "As archetype: The Cheerful Healer mends with honest optimism.",
      "As archetype: The Storyteller threads meaning through memory.",
      "As archetype: The Mentor frames setbacks as syllables of wisdom.",
      "As archetype: The Integrator turns expansion into embodiment.",
      "As archetype: The Pilgrim learns by walking.",
      "As archetype: The Mentor frames setbacks as syllables of wisdom.",
      "As archetype: The Mentor frames setbacks as syllables of wisdom.",
      "As archetype: The Storyteller threads meaning through memory.",
      "As archetype: The Sage widens horizons through lived questions.",
      "As archetype: The Storyteller threads meaning through memory.",
      "As archetype: The Explorer trusts maps drawn by practice.",
      "As archetype: The Storyteller threads meaning through memory.",
      "As archetype: The Integrator turns expansion into embodiment.",
      "As archetype: The Philosopher turns experience into lamp light.",
      "As archetype: The Storyteller threads meaning through memory.",
      "As archetype: The Philosopher turns experience into lamp light.",
      "As archetype: The Storyteller threads meaning through memory.",
      "As archetype: The Philosopher turns experience into lamp light.",
      "As archetype: The Explorer trusts maps drawn by practice.",
      "As archetype: The Explorer trusts maps drawn by practice.",
      "As archetype: The Benefactor multiplies blessings by circulation.",
      "As archetype: The Integrator turns expansion into embodiment.",
      "As archetype: The Storyteller threads meaning through memory.",
      "As archetype: The Explorer trusts maps drawn by practice.",
      "As archetype: The Storyteller threads meaning through memory.",
      "As archetype: The Explorer trusts maps drawn by practice.",
      "As archetype: The Storyteller threads meaning through memory.",
      "As archetype: The Benefactor multiplies blessings by circulation.",
      "As archetype: The Pilgrim learns by walking.",
      "As archetype: The Sage widens horizons through lived questions.",
      "As archetype: The Integrator turns expansion into embodiment.",
      "As archetype: The Philosopher turns experience into lamp light.",
      "As archetype: The Pilgrim learns by walking.",
      "As archetype: The Philosopher turns experience into lamp light."
    ],
    "energy_check": [
      "Vibe: trust‑forward—timing over urgency.",
      "Vibe: integrative expansion—grow, then digest.",
      "Vibe: trust‑forward—timing over urgency.",
      "Vibe: trust‑forward—timing over urgency.",
      "Vibe: integrative expansion—grow, then digest.",
      "Vibe: joyful gravitas—light with roots.",
      "Vibe: disciplined freedom—wide yet held.",
      "Vibe: integrative expansion—grow, then digest.",
      "Vibe: wise laughter—serious about joy.",
      "Vibe: integrative expansion—grow, then digest.",
      "Vibe: joyful gravitas—light with roots.",
      "Vibe: disciplined freedom—wide yet held.",
      "Vibe: joyful gravitas—light with roots.",
      "Vibe: integrative expansion—grow, then digest.",
      "Vibe: joyful gravitas—light with roots.",
      "Vibe: joyful gravitas—light with roots.",
      "Vibe: spacious, generous, horizon‑seeking.",
      "Vibe: spacious, generous, horizon‑seeking.",
      "Vibe: grounded optimism with clear edges.",
      "Vibe: blessing‑aware—teachers everywhere.",
      "Vibe: disciplined freedom—wide yet held.",
      "Vibe: wise laughter—serious about joy.",
      "Vibe: wise laughter—serious about joy.",
      "Vibe: disciplined freedom—wide yet held.",
      "Vibe: wise laughter—serious about joy.",
      "Vibe: joyful gravitas—light with roots.",
      "Vibe: blessing‑aware—teachers everywhere.",
      "Vibe: blessing‑aware—teachers everywhere.",
      "Vibe: spacious, generous, horizon‑seeking.",
      "Vibe: joyful gravitas—light with roots.",
      "Vibe: spacious, generous, horizon‑seeking.",
      "Vibe: philosophical, curious, meaning‑rich.",
      "Vibe: integrative expansion—grow, then digest.",
      "Vibe: joyful gravitas—light with roots.",
      "Vibe: spacious, generous, horizon‑seeking.",
      "Vibe: wise laughter—serious about joy.",
      "Vibe: trust‑forward—timing over urgency.",
      "Vibe: grounded optimism with clear edges.",
      "Vibe: wise laughter—serious about joy.",
      "Vibe: integrative expansion—grow, then digest."
    ],
    "astrological": [
      "During favorable periods, widen learning and travel curiosity.",
      "When supportive aspects arise, mentor or be mentored.",
      "Under growth transits, align generosity with discernment.",
      "In expansion seasons, study frameworks of meaning.",
      "When your chart ruler is touched, say yes to responsible growth.",
      "Through fire cycles, act boldly—then integrate.",
      "Through earth cycles, systematize growth.",
      "Through air cycles, share ideas widely.",
      "Through water cycles, cultivate compassionate trust.",
      "At personal returns, refresh your horizon.",
      "During favorable periods, widen learning and travel curiosity.",
      "When supportive aspects arise, mentor or be mentored.",
      "Under growth transits, align generosity with discernment.",
      "In expansion seasons, study frameworks of meaning.",
      "When your chart ruler is touched, say yes to responsible growth.",
      "Through fire cycles, act boldly—then integrate.",
      "Through earth cycles, systematize growth.",
      "Through air cycles, share ideas widely.",
      "Through water cycles, cultivate compassionate trust.",
      "At personal returns, refresh your horizon.",
      "During favorable periods, widen learning and travel curiosity.",
      "When supportive aspects arise, mentor or be mentored.",
      "Under growth transits, align generosity with discernment.",
      "In expansion seasons, study frameworks of meaning.",
      "When your chart ruler is touched, say yes to responsible growth.",
      "Through fire cycles, act boldly—then integrate.",
      "Through earth cycles, systematize growth.",
      "Through air cycles, share ideas widely.",
      "Through water cycles, cultivate compassionate trust.",
      "At personal returns, refresh your horizon.",
      "During favorable periods, widen learning and travel curiosity.",
      "When supportive aspects arise, mentor or be mentored.",
      "Under growth transits, align generosity with discernment.",
      "In expansion seasons, study frameworks of meaning.",
      "When your chart ruler is touched, say yes to responsible growth.",
      "Through fire cycles, act boldly—then integrate.",
      "Through earth cycles, systematize growth.",
      "Through air cycles, share ideas widely.",
      "Through water cycles, cultivate compassionate trust.",
      "At personal returns, refresh your horizon."
    ]
  },
  "meta": {
    "version": "2.0",
    "stage": "expanded_400",
    "generated_at": "2025-08-20T20:09:38",
    "counts": {
      "insight": 40,
      "reflection": 40,
      "contemplation": 40,
      "manifestation": 40,
      "challenge": 40,
      "physical_practice": 40,
      "shadow": 40,
      "archetype": 40,
      "energy_check": 40,
      "astrological": 40
    },
    "note": "Gold-standard build: 10 categories × 40 insights (generic, duplicate-free)."
  },
  "primary_persona": "NumerologyScholar"
}
